
#  Day 38 â€“ GroupBy & Aggregations with Pandas


##  Import Required Libraries

In [2]:

import pandas as pd


##  Create Sample Dataset

In [3]:

data = {
    'Department': ['IT', 'IT', 'HR', 'HR', 'Finance', 'Finance'],
    'Employee': ['A', 'B', 'C', 'D', 'E', 'F'],
    'Salary': [60000, 65000, 45000, 48000, 70000, 72000],
    'Experience': [2, 3, 1, 2, 4, 5]
}

df = pd.DataFrame(data)
df

  Department Employee  Salary  Experience
0         IT        A   60000           2
1         IT        B   65000           3
2         HR        C   45000           1
3         HR        D   48000           2
4    Finance        E   70000           4
5    Finance        F   72000           5


## GroupBy Single Column

In [4]:

df.groupby('Department')['Salary'].mean()

Department
Finance    71000.0
HR         46500.0
IT         62500.0
Name: Salary, dtype: float64


## Multiple Aggregations

In [5]:

df.groupby('Department')['Salary'].agg(['min', 'max', 'mean', 'count'])

              min    max     mean  count
Department
Finance     70000  72000  71000.0      2
HR          45000  48000  46500.0      2
IT          60000  65000  62500.0      2


## GroupBy Multiple Columns

In [6]:

df.groupby(['Department', 'Experience'])['Salary'].mean()

Department  Experience
Finance     4             70000.0
            5             72000.0
HR          1             45000.0
            2             48000.0
IT          2             60000.0
            3             65000.0
Name: Salary, dtype: float64


## Using agg() with Custom Names

In [8]:

df.groupby('Department').agg(
    Avg_Salary=('Salary', 'mean'),
    Max_Salary=('Salary', 'max'),
    Total_Employees=('Employee', 'count')
)

            Avg_Salary  Max_Salary  Total_Employees
Department
Finance        71000.0       72000                2
HR             46500.0       48000                2
IT             62500.0       65000                2